import { useState, Useeffect } from "react";
import { Container, Image, Col, Row } from "react-bootstrap";
function Home() {
  const domain = window.location.hostname;
  return (
    <>
      <Container >
        {/* <Row className="m-3">
            <Col>
              <div className="contents m-5 ">
                <h3>ยินดีต้อนรับสู่โลกของอาหารและยา</h3>
                <p>
                  อาหารและยามีความสำคัญอย่างยิ่งในชีวิตประจำวันของเรา
                  ตั้งแต่อาหารที่เรารับประทานทุกวันจนถึงยาที่ช่วยให้เราฟื้นฟูจากอาการเจ็บป่วย
                  ทั้งสองสิ่งนี้มีบทบาทสำคัญในการรักษาสุขภาพของมนุษย์
                  ไม่ว่าจะเป็นการเสริมสร้างระบบภูมิคุ้มกัน การฟื้นฟูร่างกาย
                  หรือการรักษาโรค
                </p>
              </div>
            </Col>
            <Col xs={6} md={4}>
              <div className="image-1">
                <Image src={ "https://student.crru.ac.th/651463045/drug/image/thai-food10.jpg"} thumbnail />;
              </div>
            </Col>
          </Row>

          <Row className="m-3" >
          <Col xs={6} md={4}>
              <div className="image-1">
                <Image src={"https://student.crru.ac.th/651463045/drug/image/allfood.jpg"} thumbnail />;
              </div>
            </Col>
            <Col>
              <div className="contents m-5 ">
                <h3>บทบาทของอาหารในชีวิตประจำวัน</h3>
                <p>
                อาหารไม่เพียงแค่ให้พลังงานแก่ร่างกาย
              แต่ยังมีสารอาหารที่จำเป็นเพื่อการเจริญเติบโต ซ่อมแซมส่วนที่สึกหรอ
              และป้องกันโรค
              การเลือกอาหารที่เหมาะสมสามารถช่วยให้เรามีชีวิตที่ยืนยาวและมีสุขภาพดี
              โดยสารอาหารต่างๆ ในอาหาร เช่น วิตามิน แร่ธาตุ โปรตีน และไฟเบอร์
              มีบทบาทที่แตกต่างกันไปตามความต้องการของร่างกาย
                </p>
              </div>
            </Col>
          </Row>

          <Row className="m-3">
            <Col>
              <div className="contents m-5 ">
                <h3>ความสำคัญของยาในการรักษาโรค</h3>
                <p>
                ยาถูกพัฒนาขึ้นเพื่อรักษา ป้องกัน และบรรเทาอาการของโรค
              ยาบางชนิดสามารถรักษาโรคได้อย่างตรงจุด
              ขณะที่ยาบางชนิดอาจใช้เพื่อบรรเทาอาการเท่านั้น
              การใช้ยาอย่างถูกต้องตามคำแนะนำของแพทย์มีความสำคัญอย่างยิ่งในการรักษาโรคและป้องกันผลข้างเคียงที่อาจเกิดขึ้น
                </p>
              </div>
            </Col>
            <Col xs={6} md={4}>
              <div className="image-1">
                <Image src={"https://student.crru.ac.th/651463045/drug/image/drug2.jpg"} thumbnail />;
              </div>
            </Col>
          </Row>
         
          <Row className="m-3" >
          <Col xs={6} md={4}>
              <div className="image-1">
                <Image src={"https://student.crru.ac.th/651463045/drug/image/drug.jpg"} thumbnail />;
              </div>
            </Col>
            <Col>
              <div className="contents m-5 ">
                <h3>การเชื่อมโยงระหว่างอาหารและยา</h3>
                <p>
                อาหารและยามีความสัมพันธ์กันอย่างใกล้ชิด
              อาหารที่เรารับประทานอาจส่งผลต่อประสิทธิภาพของยา เช่น
              อาหารบางชนิดอาจทำให้ยาบางชนิดทำงานได้ดีขึ้น
              หรืออาจลดประสิทธิภาพของยา
              การเข้าใจถึงความสัมพันธ์นี้ช่วยให้เราสามารถเลือกอาหารที่เหมาะสมเมื่อเราต้องรับประทานยารักษาโรค
                </p>
              </div>
            </Col>
          </Row>
       
          <Row className="m-3" >
            <Col>
              <div className="contents m-5 ">
                <h3>การป้องกันและการรักษาด้วยอาหารและยา</h3>
                <p>
                การป้องกันโรคเป็นเรื่องสำคัญมาก
              การเลือกอาหารที่มีประโยชน์และการใช้ยาที่เหมาะสมสามารถช่วยลดความเสี่ยงของโรคต่างๆ
              ได้
              การผสมผสานอาหารที่ดีต่อสุขภาพและการใช้ยาตามคำแนะนำของแพทย์เป็นกุญแจสู่การมีสุขภาพที่ดีในระยะยาว
                </p>
              </div>
            </Col>
            <Col xs={6} md={4}>
              <div className="image-1">
                <Image src={"https://student.crru.ac.th/651463045/drug/image/strong.jpg"} thumbnail />;
              </div>
            </Col>
          </Row> */}
        <Row >
          <Col>
            <div className="content m-5">
              <h3>ให้ความรู้ สร้างความมั่นใจ ดูแลสุขภาพของคุณ</h3>
              <p id="inden">
                ยินดีต้อนรับสู่เว็บไซต์ของเรา
                แหล่งข้อมูลด้านยาและสุขภาพที่ออกแบบมาเพื่อให้คุณเข้าถึงข้อมูลที่เชื่อถือได้และปลอดภัยที่สุด
                ไม่ว่าคุณจะกำลังมองหาคำแนะนำเกี่ยวกับการใช้ยาอย่างถูกต้อง
                หรือต้องการความช่วยเหลือทางการแพทย์แบบเรียลไทม์
                ทีมผู้เชี่ยวชาญของเราพร้อมเสมอที่จะสนับสนุนการดูแลสุขภาพของคุณ
              </p>
              <b>เว็บไซต์ของเรามีอะไรดีบ้าง</b>
              <ul>
                <li>
                  <b>คำแนะนำเกี่ยวกับยาอย่างถูกต้อง:</b> เมื่อคุณจำเป็นต้องใช้ยา
                  เราให้ข้อมูลที่ละเอียดเกี่ยวกับวิธีใช้ยา ข้อควรระวัง
                  และผลข้างเคียงที่อาจเกิดขึ้น
                  คุณจึงสามารถใช้ยาด้วยความมั่นใจว่าปลอดภัยและมีประสิทธิภาพสูงสุด
                </li>
                <li>
                  <b>ทีมแพทย์และเภสัชกรพร้อมให้คำปรึกษาแบบเรียลไทม์: </b>{" "}
                  หากคุณมีคำถามหรือต้องการคำแนะนำด่วน
                  ทีมผู้เชี่ยวชาญของเราพร้อมให้บริการออนไลน์ตลอด 24
                  ชั่วโมงเพื่อให้คุณได้รับคำตอบทันที
                </li>
                <li>
                  <b>คลังความรู้ด้านสุขภาพ: </b> บทความและข้อมูลต่างๆ
                  ของเราถูกเขียนโดยผู้เชี่ยวชาญและได้รับการตรวจสอบความถูกต้อง
                  ให้คุณมั่นใจได้ในข้อมูลที่เรานำเสนอ
                  ไม่ว่าจะเป็นวิธีการดูแลสุขภาพเบื้องต้น วิธีป้องกันโรค
                  หรือการใช้ยาที่ถูกต้อง
                </li>
              </ul>
              <b>เราแตกต่างอย่างไร</b>
              <ul>
                <li>
                  <b>ความถูกต้องและแม่นยำ: </b>{" "}
                  ข้อมูลทุกชิ้นที่เผยแพร่บนเว็บไซต์ของเราได้รับการตรวจสอบจากผู้เชี่ยวชาญทางการแพทย์และเภสัชกรรมอย่างเข้มงวด
                </li>
                <li>
                  <b>สะดวกสบายและทันสมัย:</b>
                  คุณสามารถเข้าถึงข้อมูลได้ทุกที่ทุกเวลา ไม่ว่าจะผ่านมือถือ
                  แท็บเล็ต หรือคอมพิวเตอร์
                  เพื่อให้คุณสามารถดูแลสุขภาพตัวเองได้ง่ายขึ้น
                </li>
                <li>
                  <b>คอมมิวนิตี้ที่พร้อมสนับสนุน:</b>เราไม่เพียงแค่ให้ข้อมูล
                  แต่ยังสร้างสังคมแห่งการดูแลสุขภาพ
                  ที่คุณสามารถแลกเปลี่ยนประสบการณ์หรือถามคำถามได้ตลอดเวลา
                </li>
              </ul>
              <b>ดูแลสุขภาพของคุณอย่างชาญฉลาดกับเรา</b>
              <p id="inden">
                {" "}
                เว็บไซต์ของเรามุ่งมั่นที่จะเป็นแหล่งข้อมูลที่เชื่อถือได้สำหรับคุณ
                ไม่ว่าคุณจะมีคำถามเกี่ยวกับยา สุขภาพ หรือการป้องกันโรค
                เราพร้อมช่วยคุณในทุกขั้นตอน
              </p>
            </div>
          </Col>
        </Row>
        <Row className="m-3">
          <Col>
            <div className="contents m-3 ">
              <h3>ทำไมเราถึงสร้างเว็บไซต์นี้?</h3>
              <p>
                ในยุคที่ข้อมูลจำนวนมหาศาลถูกเผยแพร่บนโลกออนไลน์
                ข้อมูลที่ไม่ถูกต้องเกี่ยวกับยาและการรักษาสุขภาพก็มีมากเช่นกัน
                นั่นเป็นเหตุผลว่าทำไมเราถึงสร้างเว็บไซต์นี้ขึ้นมาเพื่อเป็นแหล่งข้อมูลที่เชื่อถือได้
                และให้คำแนะนำทางการแพทย์อย่างถูกต้อง นอกจากนั้น
                เรายังเห็นถึงความจำเป็นในการให้คำปรึกษาแบบเรียลไทม์
                เพราะการดูแลสุขภาพไม่สามารถรอได้
              </p>
              <p>
                ด้วยความรู้และประสบการณ์จากทีมแพทย์และเภสัชกรของเรา
                เรามั่นใจว่าเว็บไซต์นี้จะเป็นเครื่องมือที่สำคัญในการช่วยเหลือคุณในการดูแลสุขภาพของตัวเองและคนรอบข้าง
              </p>
            </div>
          </Col>
          <Col xs={6} md={4}>
            <div className="image-1">
              <Image
                src={
                  "https://student.crru.ac.th/651463045/drug/image/strong.jpg"
                }
                thumbnail
              />
              ;
            </div>
          </Col>
        </Row>
        <Row className="m-5">
          <Col xs={6} md={4}>
            <div className="image-1">
              <Image
                src={"https://student.crru.ac.th/651463045/drug/image/drug.jpg"}
                thumbnail
              />
              ;
            </div>
          </Col>
          <Col>
            <div className="contents  ">
              <h3>บทบาทของยาและสุขภาพ</h3>
              <p>
                ยามีบทบาทสำคัญในการรักษา ป้องกัน และบรรเทาอาการของโรคต่างๆ
                ซึ่งเมื่อใช้อย่างถูกต้อง
                ยาจะช่วยให้การรักษาได้ผลดีและลดความเสี่ยงจากผลข้างเคียง
                การเลือกใช้ยาจึงต้องมาจากการพิจารณาอย่างรอบคอบและการให้คำแนะนำจากผู้เชี่ยวชาญ
                เช่นเดียวกับอาหารที่มีบทบาทในชีวิตประจำวัน
                การรับประทานอาหารที่มีประโยชน์จะช่วยเสริมสร้างร่างกายและป้องกันการเกิดโรค
              </p>
              <p>
                ที่สำคัญ
                การรู้จักใช้ยาและเลือกอาหารที่เหมาะสมสามารถส่งผลดีต่อสุขภาพในระยะยาว
                เราจึงจัดทำบทความและคำแนะนำต่างๆ
                เพื่อให้คุณได้รับข้อมูลที่ถูกต้อง เข้าใจง่าย
                และนำไปใช้ได้จริงในชีวิตประจำวัน
              </p>
            </div>
          </Col>
        </Row>
       
      </Container>
    </>
  );
}
export default Home;
